app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Electronics"], ["created_at", "2023-10-23 10:17:56.548021"], ["updated_at", "2023-10-23 10:17:56.548021"]]
---
  def create
    category = Category.new(category_params)

    if category.save