app/controllers/api/v1/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."status" = ? ORDER BY "orders"."id" DESC LIMIT ?  [["user_id", 5], ["status", "pending"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["status", "completed"], ["created_at", "2023-10-23 12:26:42.946934"], ["updated_at", "2023-10-23 12:26:42.946934"]]
UPDATE "product_inventories" SET "stock_quantity" = ?, "updated_at" = ? WHERE "product_inventories"."id" = ?  [["stock_quantity", 99], ["updated_at", "2023-10-23 12:32:22.162829"], ["id", 7]]
---
  def checkout
    product_ids = params[:product_ids]

    # Check if product_ids is an array
    if product_ids.is_a?(Array)
      # Find the user's latest order that is still pending
      order = current_user.orders.where(status: 'pending').last

      if order.nil?
        # If no pending order exists, create a new one
        order = current_user.orders.build(status: 'pending')
      end

      product_ids.each do |product_id|
        product = Product.find(product_id)

        if product
          order.products << product
          product_inventory = product.product_inventory

          if product_inventory.stock_quantity > 0
            product_inventory.update(stock_quantity: product_inventory.stock_quantity - 1)

UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "completed"], ["updated_at", "2023-10-23 12:38:06.501904"], ["id", 1]]
INSERT INTO "orders" ("user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["status", "pending"], ["created_at", "2023-10-23 12:32:22.212467"], ["updated_at", "2023-10-23 12:32:22.212467"]]
---
        end
      end

      if order.save
        order.update(status: 'completed') # Add this line to mark the order as completed

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."status" = ?  [["user_id", 5], ["status", "completed"]]
SELECT "products".* FROM "products" INNER JOIN "order_items" ON "products"."id" = "order_items"."product_id" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT SUM("products"."price") FROM "products" INNER JOIN "order_items" ON "products"."id" = "order_items"."product_id" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def checkout_history
    orders = current_user.orders.where(status: 'completed')

    checkout_history = orders.map do |order|
      {
        order: order,
        products: order.products,
        total_price: order.products.sum(:price)