app/controllers/api/v1/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    product = Product.new(product_params)

    if product.save
---
INSERT INTO "products" ("name", "description", "price", "barcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Samsung S20"], ["description", "Powerful Samsung"], ["price", 459.0], ["barcode", "32165"], ["created_at", "2023-10-23 10:21:44.387532"], ["updated_at", "2023-10-23 10:21:44.387532"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 40.0], ["updated_at", "2023-10-23 10:25:58.780342"], ["id", 1]]

  def destroy
    product = Product.find(params[:id])
    product.product_categories.destroy_all

    if product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 1]]

    def set_product
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create_product_inventory(product)
      product_inventory = ProductInventory.new(
        product: product,
        stock_quantity: params[:stock_quantity],
        restock_alert_threshold: params[:restock_alert_threshold]
      )
      product_inventory.save
---
INSERT INTO "product_inventories" ("product_id", "stock_quantity", "restock_alert_threshold", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["stock_quantity", 100], ["restock_alert_threshold", 20], ["created_at", "2023-10-23 10:31:13.959634"], ["updated_at", "2023-10-23 10:31:13.959634"]]

    def create_product_categories(product)
      category_ids = params[:category_ids]
      categories = Category.where(id: category_ids)
      product.categories << categories
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
INSERT INTO "product_categories" ("product_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["category_id", 1], ["created_at", "2023-10-23 10:31:14.017751"], ["updated_at", "2023-10-23 10:31:14.017751"]]