app/controllers/api/v1/products_controller.rb

  def filter_by_category
    category_name = params[:category_name]
    category = Category.where("lower(name) = ?", category_name.downcase).first
---
SELECT "categories".* FROM "categories" WHERE (lower(name) = 'mice') ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]