app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def register
    user = User.create(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email])

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Admin2"], ["updated_at", "2023-10-23 10:03:42.416153"], ["id", 2]]
---
  def update
    user_id = decoded_token[0]['user_id']
    @user = User.find(user_id)

    if current_user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])